------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/luiselizondogracia/Documents/GitHub/seniorthesis/dofiles/logs/2017_Data_Complete.log
  log type:  text
 opened on:  27 Aug 2022, 17:26:54

. 
. clear all

. 
. 
. 
.                                         * 2017 * Note, 2017 files contain data obtained during 2016!
.                                         
.                                         
.                                 
.                                         * Convert DBF to DTA files *
. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Admin_agua_red_cngmd2017_dbf/Bases_Datos"                      
>   
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/original/2017/Admin_agua_red_cngmd2017_dbf/Bases_Datos

. insheet using "secc_iv_tr_m5_2016.csv", comma clear
(186 vars, 2,458 obs)

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Admin_agua_red_cngmd2017_dbf/Bases_Datos/secc_iv_tr_m5_2016.d
> ta", replace
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Admin_agua_red_cngmd2017_dbf/Bases_Datos/secc_iv_tr_m5_2016.dta 
> saved

. clear

. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Prog_gest_aguapot_cngmd2017_dbf/Bases_Datos"                   
>   
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/original/2017/Prog_gest_aguapot_cngmd2017_dbf/Bases_Datos

. insheet using "secc_viii_tr_m5_2016.csv", comma clear
(7 vars, 2,458 obs)

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Prog_gest_aguapot_cngmd2017_dbf/Bases_Datos/secc_viii_tr_m5_2
> 016.dta", replace
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Prog_gest_aguapot_cngmd2017_dbf/Bases_Datos/secc_viii_tr_m5_2016
> .dta saved

. clear

. 
.                                         * Merger *
. clear

. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2017"         
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/modified/2017

. * Merge #1 *    
. use "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Admin_agua_red_cngmd2017_dbf/Bases_Datos/secc_iv_tr_m5_2016.dt
> a"

. merge 1:1 aps_folio using "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2017/Prog_gest_aguapot_cngmd2017_dbf/Bases_Da
> tos/secc_viii_tr_m5_2016.dta", gen(aaa111)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,458  (aaa111==3)
    -----------------------------------------

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2017/2017_Merged", replace  
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2017/2017_Merged.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/luiselizondogracia/Documents/GitHub/seniorthesis/dofiles/logs/2017_Data_Complete.log
  log type:  text
 closed on:  27 Aug 2022, 17:26:54
------------------------------------------------------------------------------------------------------------------------------------------------
