------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/luiselizondogracia/Documents/GitHub/seniorthesis/dofiles/logs/2019_Data_Complete.log
  log type:  text
 opened on:  27 Aug 2022, 17:26:47

. 
. clear all

. 
. 
. 
.                                         * 2019 * Note, 2019 files contain data obtained during 2018!
.                                         
.                                         
.                                 
.                                         * Convert DBF to DTA files *
. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Admin_agua_cngmd2019_dbf/Bases_Datos"                    
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/original/2019/Admin_agua_cngmd2019_dbf/Bases_Datos

. import dbase secc_iv_tr_m5_2018.dbf
(157 vars, 2,463 obs)

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Admin_agua_cngmd2019_dbf/Bases_Datos/secc_iv_tr_m5_2018.dta",
>  replace
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Admin_agua_cngmd2019_dbf/Bases_Datos/secc_iv_tr_m5_2018.dta save
> d

. clear

. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Prog_gest_agua_cngmd2019_dbf/Bases_Datos"                      
>   
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/original/2019/Prog_gest_agua_cngmd2019_dbf/Bases_Datos

. import dbase secc_viii_tr_m5_2018.dbf
(6 vars, 2,463 obs)

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Prog_gest_agua_cngmd2019_dbf/Bases_Datos/secc_viii_tr_m5_2018
> .dta", replace
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Prog_gest_agua_cngmd2019_dbf/Bases_Datos/secc_viii_tr_m5_2018.dt
> a saved

. clear

. 
.                                         * Merger *
. clear

. 
. cd "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2019"         
/Users/luiselizondogracia/Documents/GitHub/seniorthesis/data/modified/2019

. * Merge #1 *    
. use "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Admin_agua_cngmd2019_dbf/Bases_Datos/secc_iv_tr_m5_2018.dta"

. merge 1:1 folio using "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/original/2019/Prog_gest_agua_cngmd2019_dbf/Bases_Datos/sec
> c_viii_tr_m5_2018.dta", gen(aaa111)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,463  (aaa111==3)
    -----------------------------------------

. save "/Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2019/2019_Merged", replace  
file /Users/luiselizondogracia/documents/GitHub/seniorthesis/data/modified/2019/2019_Merged.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/luiselizondogracia/Documents/GitHub/seniorthesis/dofiles/logs/2019_Data_Complete.log
  log type:  text
 closed on:  27 Aug 2022, 17:26:48
------------------------------------------------------------------------------------------------------------------------------------------------
